java/jmeterTask/result/2021072510161193/2021072510161193.log
2021-07-25 10:16:18,713 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2021-07-25 10:16:18,737 INFO o.a.j.JMeter: Loading user properties from: F:\apache-jmeter-5.1.1\bin\user.properties
2021-07-25 10:16:18,738 INFO o.a.j.JMeter: Loading system properties from: F:\apache-jmeter-5.1.1\bin\system.properties
2021-07-25 10:16:18,739 INFO o.a.j.JMeter: Setting JMeter property: threadCount=10
2021-07-25 10:16:18,739 INFO o.a.j.JMeter: Setting JMeter property: rameTime=5
2021-07-25 10:16:18,739 INFO o.a.j.JMeter: Setting JMeter property: durtation=120
2021-07-25 10:16:18,748 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2021-07-25 10:16:18,748 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: java.version=1.8.0_202
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: os.name=Windows 10
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: os.arch=amd64
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: os.version=10.0
2021-07-25 10:16:18,749 INFO o.a.j.JMeter: file.encoding=GBK
2021-07-25 10:16:18,750 INFO o.a.j.JMeter: java.awt.headless=true
2021-07-25 10:16:18,750 INFO o.a.j.JMeter: Max memory     =1073741824
2021-07-25 10:16:18,750 INFO o.a.j.JMeter: Available Processors =4
2021-07-25 10:16:18,755 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-07-25 10:16:18,756 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2021-07-25 10:16:18,756 INFO o.a.j.JMeter: JMeterHome=F:\apache-jmeter-5.1.1
2021-07-25 10:16:18,756 INFO o.a.j.JMeter: user.dir  =G:\java\jmeterTask
2021-07-25 10:16:18,757 INFO o.a.j.JMeter: PWD       =G:\java\jmeterTask
2021-07-25 10:16:34,296 INFO o.a.j.JMeter: IP: 10.198.1.32 Name: DESKTOP-VS14U6A FullName: DESKTOP-VS14U6A
2021-07-25 10:16:34,302 INFO o.a.j.s.FileServer: Default base='G:\java\jmeterTask'
2021-07-25 10:16:34,311 INFO o.a.j.s.FileServer: Set new base='G:\java\jmeterTask'
2021-07-25 10:16:34,564 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-07-25 10:16:34,589 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-07-25 10:16:34,596 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-07-25 10:16:34,607 INFO o.a.j.s.SaveService: Loading file: G:\java\jmeterTask\task.jmx
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-07-25 10:16:34,683 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-07-25 10:16:34,794 INFO o.a.j.JMeter: Creating summariser <summary>
2021-07-25 10:16:34,805 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-07-25 10:16:34,806 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 10:16:34,806 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 10:16:34,824 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-07-25 10:16:34,824 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-07-25 10:16:35,916 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-beanutils-1.7.0.jar to classpath
2021-07-25 10:16:35,916 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-collections-3.1.jar to classpath
2021-07-25 10:16:35,917 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-lang-2.5(1).jar to classpath
2021-07-25 10:16:35,926 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-logging.jar to classpath
2021-07-25 10:16:35,927 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.1-jdk15.jar to classpath
2021-07-25 10:16:35,927 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.4-jdk15.jar to classpath
2021-07-25 10:16:35,928 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-path-2.4.0.jar to classpath
2021-07-25 10:16:36,004 INFO o.a.j.JMeter: Running test (1627179396004)
2021-07-25 10:16:36,052 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2021-07-25 10:16:36,052 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group 线程组.
2021-07-25 10:16:36,052 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-07-25 10:16:36,053 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=0 delayedStart=false
2021-07-25 10:16:36,079 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-1
2021-07-25 10:16:36,100 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-2
2021-07-25 10:16:36,102 INFO o.a.j.p.h.s.HTTPJavaImpl: Maximum connection retries = 0
2021-07-25 10:16:36,106 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2021-07-25 10:16:36,106 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2021-07-25 10:16:36,106 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2021-07-25 10:16:36,106 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2021-07-25 10:16:36,115 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2021-07-25 10:16:36,115 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2021-07-25 10:16:36,118 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-3
2021-07-25 10:16:36,144 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-4
2021-07-25 10:16:36,172 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-5
2021-07-25 10:16:36,187 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-6
2021-07-25 10:16:36,210 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-7
2021-07-25 10:16:36,233 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-8
2021-07-25 10:16:36,251 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2021-07-25 10:16:36,252 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-07-25 10:16:36,272 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-10
2021-07-25 10:16:36,272 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-9
2021-07-25 10:16:38,233 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2021-07-25 10:16:38,235 INFO o.a.j.u.SSLManager: KeyStore created OK
2021-07-25 10:16:38,235 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2021-07-25 10:17:00,006 INFO o.a.j.r.Summariser: summary +   5070 in 00:00:24 =  211.3/s Avg:    44 Min:    28 Max:  4118 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2021-07-25 10:17:30,002 INFO o.a.j.r.Summariser: summary +   7946 in 00:00:30 =  264.9/s Avg:    36 Min:    26 Max:   416 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2021-07-25 10:17:30,003 INFO o.a.j.r.Summariser: summary =  13016 in 00:00:54 =  241.0/s Avg:    39 Min:    26 Max:  4118 Err:     0 (0.00%)
2021-07-25 10:18:00,002 INFO o.a.j.r.Summariser: summary +   8303 in 00:00:30 =  276.8/s Avg:    34 Min:    27 Max:   244 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2021-07-25 10:18:00,012 INFO o.a.j.r.Summariser: summary =  21319 in 00:01:24 =  253.8/s Avg:    37 Min:    26 Max:  4118 Err:     0 (0.00%)
2021-07-25 10:18:30,006 INFO o.a.j.r.Summariser: summary +   7954 in 00:00:30 =  265.1/s Avg:    36 Min:    27 Max:  3111 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2021-07-25 10:18:30,009 INFO o.a.j.r.Summariser: summary =  29273 in 00:01:54 =  256.8/s Avg:    37 Min:    26 Max:  4118 Err:     0 (0.00%)
2021-07-25 10:18:36,091 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-2
2021-07-25 10:18:36,091 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-2
2021-07-25 10:18:36,120 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-3
2021-07-25 10:18:36,121 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-3
2021-07-25 10:18:36,121 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-4
2021-07-25 10:18:36,124 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-4
2021-07-25 10:18:36,138 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-1
2021-07-25 10:18:36,138 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-1
2021-07-25 10:18:36,150 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-5
2021-07-25 10:18:36,150 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-5
2021-07-25 10:18:36,164 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-6
2021-07-25 10:18:36,165 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-6
2021-07-25 10:18:36,210 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-7
2021-07-25 10:18:36,210 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-7
2021-07-25 10:18:36,218 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-8
2021-07-25 10:18:36,218 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-8
2021-07-25 10:18:36,240 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-9
2021-07-25 10:18:36,240 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-9
2021-07-25 10:18:36,262 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-10
2021-07-25 10:18:36,263 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-10
2021-07-25 10:18:36,263 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-07-25 10:18:36,272 INFO o.a.j.r.Summariser: summary +   1679 in 00:00:06 =  268.0/s Avg:    35 Min:    27 Max:   270 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2021-07-25 10:18:36,274 INFO o.a.j.r.Summariser: summary =  30952 in 00:02:00 =  257.4/s Avg:    37 Min:    26 Max:  4118 Err:     0 (0.00%)