java/jmeterTask/result/2021072513033309/2021072513033309.log
2021-07-25 03:03:39,411 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2021-07-25 03:03:39,440 INFO o.a.j.JMeter: Loading user properties from: F:\apache-jmeter-5.1.1\bin\user.properties
2021-07-25 03:03:39,441 INFO o.a.j.JMeter: Loading system properties from: F:\apache-jmeter-5.1.1\bin\system.properties
2021-07-25 03:03:39,442 INFO o.a.j.JMeter: Setting JMeter property: threadCount=10
2021-07-25 03:03:39,442 INFO o.a.j.JMeter: Setting JMeter property: ramTime=2
2021-07-25 03:03:39,442 INFO o.a.j.JMeter: Setting JMeter property: duration=120
2021-07-25 03:03:39,452 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2021-07-25 03:03:39,452 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2021-07-25 03:03:39,452 INFO o.a.j.JMeter: java.version=1.8.0_202
2021-07-25 03:03:39,452 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: os.name=Windows 10
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: os.arch=amd64
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: os.version=10.0
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: file.encoding=GBK
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: java.awt.headless=true
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: Max memory     =1073741824
2021-07-25 03:03:39,453 INFO o.a.j.JMeter: Available Processors =4
2021-07-25 03:03:39,459 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-07-25 03:03:39,460 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2021-07-25 03:03:39,460 INFO o.a.j.JMeter: JMeterHome=F:\apache-jmeter-5.1.1
2021-07-25 03:03:39,460 INFO o.a.j.JMeter: user.dir  =G:\java\jmeterTask
2021-07-25 03:03:39,461 INFO o.a.j.JMeter: PWD       =G:\java\jmeterTask
2021-07-25 03:03:54,995 INFO o.a.j.JMeter: IP: 10.198.1.32 Name: DESKTOP-VS14U6A FullName: DESKTOP-VS14U6A
2021-07-25 03:03:55,002 INFO o.a.j.s.FileServer: Default base='G:\java\jmeterTask'
2021-07-25 03:03:55,009 INFO o.a.j.s.FileServer: Set new base='G:\java\jmeterTask'
2021-07-25 03:03:55,354 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-07-25 03:03:55,383 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-07-25 03:03:55,391 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-07-25 03:03:55,404 INFO o.a.j.s.SaveService: Loading file: G:\java\jmeterTask\task.jmx
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-07-25 03:03:55,496 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-07-25 03:03:55,624 INFO o.a.j.JMeter: Creating summariser <summary>
2021-07-25 03:03:55,634 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-07-25 03:03:55,635 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 03:03:55,635 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 03:03:55,649 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-07-25 03:03:55,649 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-07-25 03:03:56,460 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-beanutils-1.7.0.jar to classpath
2021-07-25 03:03:56,460 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-collections-3.1.jar to classpath
2021-07-25 03:03:56,460 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-lang-2.5(1).jar to classpath
2021-07-25 03:03:56,469 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-logging.jar to classpath
2021-07-25 03:03:56,470 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.1-jdk15.jar to classpath
2021-07-25 03:03:56,470 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.4-jdk15.jar to classpath
2021-07-25 03:03:56,470 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-path-2.4.0.jar to classpath
2021-07-25 03:03:56,557 INFO o.a.j.JMeter: Running test (1627153436557)
2021-07-25 03:03:56,608 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2021-07-25 03:03:56,609 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group 线程组.
2021-07-25 03:03:56,609 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-07-25 03:03:56,610 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=0 delayedStart=false
2021-07-25 03:03:56,624 ERROR o.a.j.u.JMeterUtils: Error occurred starting thread group :线程组, error message:Invalid duration 0 set in Thread Group:线程组, 
see log file for more details
org.apache.jorphan.util.JMeterStopTestException: Invalid duration 0 set in Thread Group:线程组
	at org.apache.jmeter.threads.ThreadGroup.scheduleThread(ThreadGroup.java:205) ~[ApacheJMeter_core.jar:5.1.1 r1855137]
	at org.apache.jmeter.threads.ThreadGroup.startNewThread(ThreadGroup.java:263) ~[ApacheJMeter_core.jar:5.1.1 r1855137]
	at org.apache.jmeter.threads.ThreadGroup.start(ThreadGroup.java:242) ~[ApacheJMeter_core.jar:5.1.1 r1855137]
	at org.apache.jmeter.engine.StandardJMeterEngine.startThreadGroup(StandardJMeterEngine.java:526) [ApacheJMeter_core.jar:5.1.1 r1855137]
	at org.apache.jmeter.engine.StandardJMeterEngine.run(StandardJMeterEngine.java:451) [ApacheJMeter_core.jar:5.1.1 r1855137]
	at java.lang.Thread.run(Unknown Source) [?:1.8.0_202]
2021-07-25 03:03:56,630 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-07-25 03:03:56,630 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-07-25 03:03:56,632 INFO o.a.j.r.Summariser: summary =      0 in 00:00:00 = ******/s Avg:     0 Min: 9223372036854775807 Max: -9223372036854775808 Err:     0 (0.00%)