java/jmeterTask/result/ask01.log
2021-07-25 02:17:29,431 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2021-07-25 02:17:29,462 INFO o.a.j.JMeter: Loading user properties from: F:\apache-jmeter-5.1.1\bin\user.properties
2021-07-25 02:17:29,463 INFO o.a.j.JMeter: Loading system properties from: F:\apache-jmeter-5.1.1\bin\system.properties
2021-07-25 02:17:29,473 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2021-07-25 02:17:29,473 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2021-07-25 02:17:29,474 INFO o.a.j.JMeter: java.version=1.8.0_202
2021-07-25 02:17:29,474 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2021-07-25 02:17:29,474 INFO o.a.j.JMeter: os.name=Windows 10
2021-07-25 02:17:29,474 INFO o.a.j.JMeter: os.arch=amd64
2021-07-25 02:17:29,475 INFO o.a.j.JMeter: os.version=10.0
2021-07-25 02:17:29,475 INFO o.a.j.JMeter: file.encoding=GBK
2021-07-25 02:17:29,475 INFO o.a.j.JMeter: java.awt.headless=true
2021-07-25 02:17:29,476 INFO o.a.j.JMeter: Max memory     =1073741824
2021-07-25 02:17:29,476 INFO o.a.j.JMeter: Available Processors =4
2021-07-25 02:17:29,482 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-07-25 02:17:29,483 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2021-07-25 02:17:29,483 INFO o.a.j.JMeter: JMeterHome=F:\apache-jmeter-5.1.1
2021-07-25 02:17:29,483 INFO o.a.j.JMeter: user.dir  =G:\java\jmeterTask
2021-07-25 02:17:29,484 INFO o.a.j.JMeter: PWD       =G:\java\jmeterTask
2021-07-25 02:17:45,016 INFO o.a.j.JMeter: IP: 10.198.1.32 Name: DESKTOP-VS14U6A FullName: DESKTOP-VS14U6A
2021-07-25 02:17:45,024 INFO o.a.j.s.FileServer: Default base='G:\java\jmeterTask'
2021-07-25 02:17:45,032 INFO o.a.j.s.FileServer: Set new base='G:\java\jmeterTask'
2021-07-25 02:17:45,425 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-07-25 02:17:45,482 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-07-25 02:17:45,491 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-07-25 02:17:45,505 INFO o.a.j.s.SaveService: Loading file: G:\java\jmeterTask\task01.jmx
2021-07-25 02:17:45,620 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 02:17:45,620 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 02:17:45,620 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 02:17:45,621 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-07-25 02:17:45,621 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-07-25 02:17:45,621 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-07-25 02:17:45,712 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2021-07-25 02:17:45,914 INFO o.a.j.JMeter: Creating summariser <summary>
2021-07-25 02:17:45,928 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-07-25 02:17:45,929 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 02:17:45,930 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-07-25 02:17:45,941 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-07-25 02:17:45,941 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-07-25 02:17:46,855 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-beanutils-1.7.0.jar to classpath
2021-07-25 02:17:46,856 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-collections-3.1.jar to classpath
2021-07-25 02:17:46,856 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-lang-2.5(1).jar to classpath
2021-07-25 02:17:46,857 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\commons-logging.jar to classpath
2021-07-25 02:17:46,858 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.1-jdk15.jar to classpath
2021-07-25 02:17:46,870 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-lib-2.4-jdk15.jar to classpath
2021-07-25 02:17:46,871 INFO o.a.j.t.TestPlan: added F:\apache-jmeter-5.1.1\lib\json-path-2.4.0.jar to classpath
2021-07-25 02:17:47,067 INFO o.a.j.JMeter: Running test (1627150667067)
2021-07-25 02:17:47,131 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2021-07-25 02:17:47,132 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group 线程组.
2021-07-25 02:17:47,132 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-07-25 02:17:47,132 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2021-07-25 02:17:47,159 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-1
2021-07-25 02:17:47,273 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-VS14U6A
2021-07-25 02:17:47,344 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2021-07-25 02:17:47,351 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2021-07-25 02:17:47,352 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2021-07-25 02:17:47,352 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2021-07-25 02:17:47,353 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2021-07-25 02:17:47,731 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2021-07-25 02:17:47,731 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-07-25 02:17:47,755 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-2
2021-07-25 02:17:47,851 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2021-07-25 02:17:47,874 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2021-07-25 02:17:47,874 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2021-07-25 02:17:48,190 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-3
2021-07-25 02:17:48,977 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-4
2021-07-25 02:17:49,192 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-5
2021-07-25 02:17:49,677 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-6
2021-07-25 02:17:50,058 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2021-07-25 02:17:50,061 INFO o.a.j.u.SSLManager: KeyStore created OK
2021-07-25 02:17:50,061 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2021-07-25 02:17:50,207 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-7
2021-07-25 02:17:50,667 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-8
2021-07-25 02:17:51,205 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-9
2021-07-25 02:17:51,706 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-10
2021-07-25 02:18:00,007 INFO o.a.j.r.Summariser: summary +    549 in 00:00:13 =   42.4/s Avg:   183 Min:    83 Max:  4364 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2021-07-25 02:18:17,265 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-2
2021-07-25 02:18:17,266 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-2
2021-07-25 02:18:17,276 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-1
2021-07-25 02:18:17,276 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-1
2021-07-25 02:18:17,279 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-4
2021-07-25 02:18:17,279 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-4
2021-07-25 02:18:17,283 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-3
2021-07-25 02:18:17,283 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-3
2021-07-25 02:18:17,568 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-6
2021-07-25 02:18:17,568 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-6
2021-07-25 02:18:17,583 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-7
2021-07-25 02:18:17,583 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-7
2021-07-25 02:18:17,587 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-5
2021-07-25 02:18:17,587 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-5
2021-07-25 02:18:17,693 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-10
2021-07-25 02:18:17,694 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-10
2021-07-25 02:18:17,736 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-9
2021-07-25 02:18:17,736 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-9
2021-07-25 02:18:17,770 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 线程组 1-8
2021-07-25 02:18:17,770 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-8
2021-07-25 02:18:17,771 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-07-25 02:18:17,772 INFO o.a.j.r.Summariser: summary +   1358 in 00:00:18 =   76.4/s Avg:   127 Min:    80 Max:   497 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2021-07-25 02:18:17,774 INFO o.a.j.r.Summariser: summary =   1907 in 00:00:31 =   62.1/s Avg:   143 Min:    80 Max:  4364 Err:     0 (0.00%)